# • Вихідний код має бути розміщений на github або іншому подібному сервісі.
# • Створіть архітектуру застосунку використовуючи функції/класи.
# • Необхідно розробити та реалізувати графічний інтерфейс.
# • У застосунку обов'язково мають бути фігури - ігрові об'єкти(не менше за 7 - квадрат, лінія тощо) та геймплей.
# • Декомпозиція та композиція.
# • Інкапсуляція, успадкування, поліморфізм, обробка подій.
# • Створення спеціальних типів даних.
# • Додайте зв'язок компонентів між собою.
# • Статистику зберігайте у файлі.
# • Наприкінці додайте тестування (за можливістю).
